{"keras_version": "2.0.8", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["conv2d_23", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 3, 224, 224], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"name": "conv2d_1", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"name": "conv2d_2", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"name": "conv2d_3", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"name": "conv2d_4", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"name": "conv2d_5", "filters": 128, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"name": "conv2d_6", "filters": 128, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"name": "conv2d_7", "filters": 256, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"name": "conv2d_8", "filters": 256, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"name": "conv2d_9", "filters": 512, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"name": "conv2d_10", "filters": 512, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "config": {"name": "max_pooling2d_5", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"name": "conv2d_11", "filters": 1024, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "conv2d_12", "config": {"name": "conv2d_12", "filters": 1024, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "config": {"data_format": "channels_first", "name": "up_sampling2d_1", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"name": "conv2d_13", "config": {"name": "conv2d_13", "filters": 512, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_14", "config": {"name": "conv2d_14", "filters": 512, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "config": {"data_format": "channels_first", "name": "up_sampling2d_2", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "concatenate_2", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_15", "config": {"name": "conv2d_15", "filters": 256, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "conv2d_16", "config": {"name": "conv2d_16", "filters": 256, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "config": {"data_format": "channels_first", "name": "up_sampling2d_3", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "concatenate_3", "config": {"axis": 1, "name": "concatenate_3", "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_17", "config": {"name": "conv2d_17", "filters": 128, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "conv2d_18", "config": {"name": "conv2d_18", "filters": 128, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "config": {"data_format": "channels_first", "name": "up_sampling2d_4", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "concatenate_4", "config": {"axis": 1, "name": "concatenate_4", "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_19", "config": {"name": "conv2d_19", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "conv2d_20", "config": {"name": "conv2d_20", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "up_sampling2d_5", "config": {"data_format": "channels_first", "name": "up_sampling2d_5", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "concatenate_5", "config": {"axis": 1, "name": "concatenate_5", "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_21", "config": {"name": "conv2d_21", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "conv2d_22", "config": {"name": "conv2d_22", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "conv2d_23", "config": {"name": "conv2d_23", "filters": 1, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}}