{"keras_version": "2.0.8", "class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 3, 224, 224], "name": "input_1", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"filters": 32, "activation": "relu", "trainable": true, "name": "conv2d_1", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"filters": 32, "activation": "relu", "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"config": {"filters": 64, "activation": "relu", "trainable": true, "name": "conv2d_3", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"filters": 64, "activation": "relu", "trainable": true, "name": "conv2d_4", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"config": {"filters": 128, "activation": "relu", "trainable": true, "name": "conv2d_5", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"filters": 128, "activation": "relu", "trainable": true, "name": "conv2d_6", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"config": {"filters": 256, "activation": "relu", "trainable": true, "name": "conv2d_7", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"filters": 256, "activation": "relu", "trainable": true, "name": "conv2d_8", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"config": {"filters": 512, "activation": "relu", "trainable": true, "name": "conv2d_9", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_9"}, {"config": {"filters": 512, "activation": "relu", "trainable": true, "name": "conv2d_10", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "conv2d_10"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_5", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"config": {"filters": 1024, "activation": "relu", "trainable": true, "name": "conv2d_11", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_11"}, {"config": {"filters": 1024, "activation": "relu", "trainable": true, "name": "conv2d_12", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "conv2d_12"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling2d_1", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "name": "concatenate_1"}, {"config": {"filters": 512, "activation": "relu", "trainable": true, "name": "conv2d_13", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_13"}, {"config": {"filters": 512, "activation": "relu", "trainable": true, "name": "conv2d_14", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "conv2d_14"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling2d_2", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"config": {"trainable": true, "name": "concatenate_2", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "name": "concatenate_2"}, {"config": {"filters": 256, "activation": "relu", "trainable": true, "name": "conv2d_15", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv2d_15"}, {"config": {"filters": 256, "activation": "relu", "trainable": true, "name": "conv2d_16", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "conv2d_16"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling2d_3", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "up_sampling2d_3"}, {"config": {"trainable": true, "name": "concatenate_3", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "name": "concatenate_3"}, {"config": {"filters": 128, "activation": "relu", "trainable": true, "name": "conv2d_17", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv2d_17"}, {"config": {"filters": 128, "activation": "relu", "trainable": true, "name": "conv2d_18", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "conv2d_18"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling2d_4", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "up_sampling2d_4"}, {"config": {"trainable": true, "name": "concatenate_4", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "name": "concatenate_4"}, {"config": {"filters": 64, "activation": "relu", "trainable": true, "name": "conv2d_19", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv2d_19"}, {"config": {"filters": 64, "activation": "relu", "trainable": true, "name": "conv2d_20", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "conv2d_20"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling2d_5", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "up_sampling2d_5"}, {"config": {"trainable": true, "name": "concatenate_5", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "name": "concatenate_5"}, {"config": {"filters": 32, "activation": "relu", "trainable": true, "name": "conv2d_21", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "conv2d_21"}, {"config": {"filters": 32, "activation": "relu", "trainable": true, "name": "conv2d_22", "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "conv2d_22"}, {"config": {"filters": 1, "activation": "sigmoid", "trainable": true, "name": "conv2d_23", "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "conv2d_23"}], "output_layers": [["conv2d_23", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}